# Даны два неупорядоченных набора целых чисел (может быть, с повторениями).

# Выдать без повторений в порядке возрастания все те числа, которые встречаются в обоих наборах.

# Пользователь вводит 2 числа. 
# n — кол-во элементов первого множества. 
# m — кол-во элементов второго множества. Затем пользователь вводит сами элементы множеств.


n = (int(input("Введите количество элементов в первом списке")))
set_1 = (int(input("Задайте список: ")))
m = (int(input("Введите количество элементов во втором списке")))
set_2 = (int(input("Задайте список: ")))

print 